Revit 2027 API
PanelScheduleView.GetCircuitIdByCell Method
 Gets the circuit id for the given slot number
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetCircuitIdByCell(
	int nRow,
	int nCol
)
Public Function GetCircuitIdByCell (
	nRow As Integer,
	nCol As Integer
) As ElementId
public:
ElementId^ GetCircuitIdByCell(
	int nRow,
	int nCol
)
member GetCircuitIdByCell :
        nRow : int *
        nCol : int -> ElementId
Parameters
nRow Int32
 Row Number
nCol Int32
 Column Number
Return Value
ElementId
 ElementId of the circuit found at the given row and column
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace